test/loadTest-Request.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    # - duration: 60
    #   arrivalRate: 10
    #   rampTo: 1000
    #   name: "ramp up some logins"
    - duration: 60
      arrivalRate: 100
      name: "constant 100 req/s"
    - duration: 60
      arrivalRate: 200
      name: "constant 200 req/s"
    - duration: 60
      arrivalRate: 300
      name: "constant 300 req/s"
    - duration: 60
      arrivalRate: 400
      name: "constant 400 req/s"
    - duration: 60
      arrivalRate: 500
      name: "constant 500 req/s"
    - duration: 60
      arrivalRate: 600
      name: "constant 600 req/s"
    - duration: 60
      arrivalRate: 700
      name: "constant 700 req/s"
    - duration: 60
      arrivalRate: 800
      name: "constant 800 req/s"
    - duration: 60
      arrivalRate: 900
      name: "constant 900 req/s"
    - duration: 60
      arrivalRate: 1000
      name: "constant 1000 req/s"
  payload:
    - path: "./data/payload.csv"
      fields:
        - "driverId"
        - "zip"
        - "lat"
        - "lng"
      order: "sequence"
scenarios:
  - name: "Request"
    flow:
    - post:
        url: "/requestdriver"
        json:
          driverId: "{{ driverId }}"
          loc_zip: "{{ zip }}"
          loc_lat: "{{ lat }}"
          loc_lng: "{{ lng }}"
          dest_zip: "{{ zip }}"
          dest_lat: "{{ lat }}"
          dest_lng: "{{ lng }}"