test/loadTest.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 1000
  payload:
      - path: "./data/payload.csv"
        fields:
          - "driverId"
  # defaults:
    # headers:
    #   x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Login"
    flow:
    - post:
        url: "/drivers/login"
        json:
          driverId: "{{ driverId }}"
  # - name: "Logout"
  #   flow:
  #   - post:
  #       url: "/drivers/logout"
  #       json:
  #         driverId: "{{ driverId }}"